001000 IDENTIFICATION DIVISION.
001100 PROGRAM-ID. EMPLEADO01.
002000 ENVIRONMENT DIVISION.
003000 DATA DIVISION.
003100 WORKING-STORAGE SECTION.
003200  01 EMPLEADO-DATOS.
003300   05 NUMERO-DE-EMPLEADO PIC 9(6) VALUE 000000.
003400   05 NOMBRE-COMPLETO PIC X(30) VALUE "Laura Guizar".
003500   05 DEPARTAMENTO PIC X(10) VALUE "Gerencia".
003600   05 SUELDO-BASE PIC 9(5)V99 VALUE 99999.99.
003700   05 DESCUENTO PIC V99.
003800   05 SUELDO-NETO PIC 9(5)V99.
004000 PROCEDURE DIVISION.
004100*Lógica de negocio
004110     EVALUATE TRUE
004120      WHEN SUELDO-BASE < 30000
004130       MOVE .10 TO DESCUENTO
004140      WHEN SUELDO-BASE < 70000
004150       MOVE .20 TO DESCUENTO
004160      WHEN OTHER
004170       MOVE .30 TO DESCUENTO
004180     END-EVALUATE.
004600*Realiza el cálculo
004610     COMPUTE SUELDO-NETO = SUELDO-BASE * (1 - DESCUENTO).
005000*Imprime los datos
005100     DISPLAY "Numero de Empleado: " NUMERO-DE-EMPLEADO.
005200     DISPLAY "Nombre Completo: " NOMBRE-COMPLETO.
005300     DISPLAY "DEPARTAMENTO: " DEPARTAMENTO.
005400     DISPLAY "Sueldo Base: $" SUELDO-BASE.
009100     STOP RUN.
