001000 IDENTIFICATION DIVISION.
001100 PROGRAM-ID. EMPLEADO01.
002000 ENVIRONMENT DIVISION.
002100 INPUT-OUTPUT SECTION.
002200 FILE CONTROL.
002300  SELECT EMPLEADOS ASSIGN TO "empleados.dat" 
002301    ORGANIZATION IS SECUENTIAL.
003000 DATA DIVISION.
003100 FILE SECTION.
003110 FD EMPLEADOS.
003120 01 REGISTRO-EMPLEADO.
003130   05 NUMERO-DE-EMPLEADO PIC 9(6).
003140   05 NOMBRE-COMPLETO PIC X(30).
003150   05 DEPARTAMENTO PIC X(10).
003160   05 SUELDO-BASE PIC 9(5)V99.
003170   05 DESCUENTO PIC V99.
003180   05 SUELDO-NETO PIC 9(5)V99.
003200 WORKING-STORAGE SECTION.
003210 01 WS-REGISTRO-EMPLEADO.
003220   05 WS-NUMERO-DE-EMPLEADO PIC 9(6) VALUE 000000.
003230   05 WS-NOMBRE-COMPLETO PIC X(30) VALUE "Laura Guizar".
003240   05 WS-DEPARTAMENTO PIC X(10) VALUE "Gerencia".
003250   05 WS-SUELDO-BASE PIC 9(5)V99 VALUE 99999.99.
003260   05 WS-DESCUENTO PIC V99.
003270   05 WS-SUELDO-NETO PIC 9(5)V99.
004000 PROCEDURE DIVISION.
004100*Lógica de negocio
004110     EVALUATE TRUE
004120      WHEN WS-SUELDO-BASE < 30000
004130       MOVE .10 TO WS-DESCUENTO
004140      WHEN WS-SUELDO-BASE < 70000
004150       MOVE .20 TO WS-DESCUENTO
004160      WHEN OTHER
004170       MOVE .30 TO WS-DESCUENTO
004180     END-EVALUATE.
004600*Realiza el cálculo
004610     COMPUTE WS-SUELDO-NETO ROUNDED = WS-SUELDO-BASE * (1 - WS-DESCUENTO).
004700*Escribe el archivo
004710     OPEN OUTPUT EMPLEADOS.
004720     MOVE WS-REGISTRO-EMPLEADO TO REGISTRO-EMPLEADO.
004730     WRITE REGISTRO-EMPLEADO.
004740     CLOSE EMPLEADOS.
005000*Imprime los datos
005010     OPEN INPUT EMPLEADOS.
005020     READ REGISTRO-EMPLEADO
005030      AT END
005031       DISPLAY "FIN DEL REGISTRO"
005040      NOT AT END
005100       DISPLAY "Numero de Empleado: " WS-NUMERO-DE-EMPLEADO.
005200       DISPLAY "Nombre Completo: " WS-NOMBRE-COMPLETO.
005300       DISPLAY "WS-DEPARTAMENTO: " WS-DEPARTAMENTO.
005400       DISPLAY "Sueldo Base: $" WS-SUELDO-BASE.
005500       DISPLAY "WS-DESCUENTO: " WS-DESCUENTO.
005600       DISPLAY "Sueldo Neto: $" WS-SUELDO-NETO.
005610     END-READ.
009100     STOP RUN.
